Repository: opensourcesys/numpadNavMode
Catalog: addon/locale/*/add-ons/LC_MESSAGES/nvda.po
Languages: he, ro

source: Check for &add-on updates...
he: התחל בדיקה של עדכוני תוספים לNVDA ...
ro: Caută actualizări pentru &suplimente...

source: Check for NVDA add-on updates
he: בדוק עדכוני תוספים לNVDA
ro: Caută actualizări pentru suplimentele din NVDA

source: Automatically check for add-on &updates
he: בדיקה אוטומטית של עדכונים
ro: Caută automat &actualizări pentru suplimente

source: &Add-on update notification:
ro: &Notificare actualizare supliment:

source: Do &not update add-ons:
he: אל תעדכן את התוספים:
ro: &Exclude următoarele suplimente de la actualizare:

source: Prefer &development releases:
ro: &Prefer versiuni de dezvoltare:

source: Legacy add-ons found
ro: Au fost găsite suplimente tradiționale

source: One or more legacy add-ons were found in your NVDA installation. Features from these add-ons are now part of the NVDA version you are using or declared legacy by add-on developers. Please disable or uninstall these add-ons by going to NVDA menu, Tools, Manage Add-ons.
ro: A fost găsit un supliment tradițional, ori chiar mai multe, în configurația dumneavoastră de NVDA. Anumite caracteristici ale acestor suplimente vechi fac parte acum din versiunea de NVDA pe care o aveți instalată în acest moment. Dezactivați sau dezinstalați aceste suplimente mergând în meniul NVDA, Instrumente, Administrare suplimente.

source: Legacy add-ons
ro: Suplimente tradiționale

source: Legacy reason
ro: Motivul pentru care unul sau mai multe suplimente sunt tradiționale

source: Add-on update check
he: בדיקת עדכון לתוספים
ro: Căutare de actualizări pentru Supliment

source: Checking for add-on updates...
he: בודק קיומם של עדכונים עבור התוספים....
ro: Se caută actualizările...

source: Error checking for add-on updates.
he: שגיאה במהלך הבדיקה .
ro: Eroare la căutarea actualizărilor.

source: NVDA Add-on Updates
he: עדכונים עבור תוספי NVDA
ro: Actualizări pentru suplimente NVDA

source: Add-on updates available: {updateCount}
ro: Sunt disponibile actualizări pentru suplimente: {updateCount}

source: Current version
he: גירסה נוכחית
ro: Versiune curentă

source: New version
he: גירסה חדשה
ro: Versiune nouă

source: No add-on update available.
he: לא נמצאו עדכונים
ro: Nu este disponibilă nici o actualizare pentru suplimente.

source: &Update add-ons
he: &עדכן תוספים
ro: &actualizați suplimentele

source: Downloading Add-on Update
he: מוריד את עדכוני התוספים
ro: Actualizarea suplimentului se descarcă

source: Downloading {name}
he: מוריד את {name}
ro: Se descarcă {name}

source: Error downloading update for {name}.
he: שגיאה במהלך הורדת העדכון עבור {name}
ro: Eroare la descărcarea actualizării pentru {name}.

source: Cannot update {name} - missing file or invalid file format
he: עדכון {name} נכשלה, עקב חוסר בקבצים או פורמט לא תקין שלהם.
ro: Nu se poate actualiza suplimentul {name} - fișierul lipsește sau formatul de fișier nu este valid

source: Updating {name}
he: מעדכן את {name}...
ro: Se actualizează {name}

source: Please wait while the add-on is being updated.
he: אנא המתן בזמן ביצוע העידכון....
ro: Așteptați până când suplimentul este actualizat.

source: Failed to update {name} add-on
he: עדכון התוסף {name} נכשלה
ro: Nu s-a putut actualiza suplimentul {name}

source: features included in NVDA
ro: caracteristici incluse în NVDA

source: declared legacy by add-on developers
ro: suplimente declarate de dezvoltatori ca fiind tradiționale

source: One or more add-on updates are available. Go to NVDA menu, Tools, Check for add-on updates to review them.
ro: Una sau mai multe actualizări de suplimente sunt disponibile. Mergeți în meniul NVDA, Instrumente, Caută actualizări pentru suplimente pentru a le examina.

source: Proof of concept implementation of add-on update feature (NVDA Core issue 3208)
he: הוכחת יכולת בביצוע עדכונים דרך תוסף NVDA .
ro: Concept experimental pentru implementarea actualizărilor automate pentru suplimente (NVDA Core issue 3208)

source: Add-on Updater
he: בודק העדכונים של תוספיי NVDA

source: Prefer development releases:
he: עדיפות לגירסאות מפתחים :

source: {name} add-on is not compatible with this version of Windows.
he: התוסף {name} אינו תואם לגירסת חלונותהמותקנת על המחשב.
