Repository: opensourcesys/numpadNavMode
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: hi, hu

source: Check for &add-on updates...
hi: &add-on अपडेट के लिए जांचें.
hu: Bővítmény-&frissítések keresése

source: Check for NVDA add-on updates
hi: एनविडीए ऐड-ऑन अपडेट के लिए जाँच करें
hu: Frissítéseket keres az NVDA bővítményeihez

source: Add-on Updater
hi: ऐड-ऑन अपडेट करने वाला
hu: Bővítmény-frissítő

source: Automatically check for add-on &updates
hi: खुद ब खुद &add-on अपडेट के लिए जांचें
hu: Bővítmény frissítések &automatikus keresése

source: Do &not update add-ons:
hi: ऐड-ऑन अपडेट न &not करें:
hu: &Ne frissítse az alábbi bővítményeket:

source: Prefer development releases:
hi: विकास रिलीज की प्राथमिकता:
hu: Fejlesztői verziók előnyben részesítése:

source: Add-on update check
hi: ऐड-ऑन अपडेट चेक
hu: Bővítmény frissítések keresése

source: Checking for add-on updates...
hi: ऐड-ऑन अपडेट की जाँच कर रहा है...
hu: Bővítmény frissítések keresése...

source: Error checking for add-on updates.
hi: ऐड-ऑन अपडेट के लिए त्रुटि जाँच.
hu: hiba történt a frissítések keresése közben.

source: NVDA Add-on Updates
hi: NVDA ऐड-ऑन अपडेट
hu: NVDA bővítmény-frissítések

source: Current version
hi: वर्तमान संस्करण
hu: Jelenlegi verzió

source: New version
hi: नया संस्करण
hu: Új verzió

source: No add-on update available.
hi: कोई ऐड-ऑन अपडेट उपलब्ध नहीं है.
hu: Nincs elérhető frissítés a telepített bővítményekhez.

source: &Update add-ons
hi: ऐड-ऑन अपडेट &Update
hu: Bővítmények &frissítése

source: Downloading Add-on Update
hi: ऐड-ऑन अपडेट डाउनलोड हो रहा है
hu: Bővítmény frissítésének letöltése

source: Downloading {name}
hi: {name} डाउनलोड हो रहा है
hu: {name} letöltése

source: Error downloading update for {name}.
hi: {name} अपडेट डाउनलोड करने में त्रुटि.
hu: {name} bővítmény letöltése közben hiba történt.

source: Cannot update {name} - missing file or invalid file format
hi: {name} - गुम फ़ाइल या अमान्य फ़ाइल प्रारूप को अपडेट नहीं किया जा सकता
hu: {name} nem frissíthető - hiányzó fájl, vagy hibás fájlformátum miatt.

source: {name} add-on is not compatible with this version of Windows.
hi: {name} ऐड-ऑन विंडोज के इस संस्करण के साथ संगत नहीं है.
hu: {name} bővítmény nem kompatibilis a jelenlegi Windows verzióval.

source: Updating {name}
hi: {name} को अपडेट किया जा रहा है
hu: {name} frissítése

source: Please wait while the add-on is being updated.
hi: कृपया ऐड-औन के अपडेट होने तक प्रतीक्षा करें.
hu: Kérem várjon, a bővítmény frissítése folyamatban.

source: Failed to update {name} add-on
hi: {name} ऐड-औन स्थापित करने मे नाकाम
hu: {name} frissítése közben hiba történt.

source: Proof of concept implementation of add-on update feature (NVDA Core issue 3208)
hi: ऐड-ऑन अपडेट सुविधा की अवधारणा कार्यान्वयन का सबूत (एनवीडीए कोर मुद्दा 3208)
hu: Tesztelési célokat szolgáló fejlesztés (az NVDA 3208 számú hibajegyének egy lehetséges megoldása)
